ГТС/УТГТС/InformationRegisters/ОграниченияВыгрузкиОстатковМаркетплейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОграниченияВыгрузкиОстатковМаркетплейсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентОстатка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтраховойЗапас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОграничения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗаписьМаркетплейса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиМаркетплейсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбластьДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ТоварныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/ОграниченияВыгрузкиОстатковМаркетплейсов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаОграничениеОстатковДетали.Видимость = Запись.Используется;
	
	ЗаполнитьТипОбластиДействия();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзмененоОграничениеВыгрузкиОстатковМаркетплейсов");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбластьДействияПриИзменении(Элемент)
	
	ЗаполнитьТипОбластиДействия();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяПриИзменении(Элемент)
	
	Элементы.ГруппаОграничениеОстатковДетали.Видимость = Запись.Используется;
	
	УстановитьПредставлениеЗаписи();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентОстаткаПриИзменении(Элемент)
	
	УстановитьПредставлениеЗаписи();       
	
КонецПроцедуры

&НаКлиенте
Процедура СтраховойЗапасПриИзменении(Элемент)
	
	УстановитьПредставлениеЗаписи();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПредставлениеЗаписи()
	
	РегистрыСведений.ОграниченияВыгрузкиОстатковМаркетплейсов.УстановитьПредставлениеЗаписи(Запись);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипОбластиДействия()
	
	Если Не ЗначениеЗаполнено(Запись.ОбластьДействия) Тогда
		ТипОбластиДействия = "";
	ИначеЕсли ТипЗнч(Запись.ОбластьДействия) = Тип("СправочникСсылка.Номенклатура")
				И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ОбластьДействия, "ЭтоГруппа") Тогда
		ТипОбластиДействия = "(" + НСтр("ru = 'Номенклатура'") + ")";
	ИначеЕсли ТипЗнч(Запись.ОбластьДействия) = Тип("СправочникСсылка.Номенклатура") Тогда
		ТипОбластиДействия = "(" + НСтр("ru = 'Группа номенклатуры'") + ")";
	ИначеЕсли ТипЗнч(Запись.ОбластьДействия) = Тип("СправочникСсылка.ТоварныеКатегории") Тогда
		ТипОбластиДействия = "(" + НСтр("ru = 'Товарная категория'") + ")";
	ИначеЕсли ТипЗнч(Запись.ОбластьДействия) = Тип("СправочникСсылка.ВидыНоменклатуры") Тогда
		ТипОбластиДействия = "(" + НСтр("ru = 'Вид номенклатуры'") + ")";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
